year_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
             10: "Осень", 11: "Осень", 12: "Зима"}
year_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень",
             "Осень", "Осень", "Зима"]
month = 0
while month == 0:
    month = input('Какой месяц вас интересует?(1-12):')
    if month.isdecimal():
        month = int(month)
    if 0 < month < 13:
        break
    month = 0
    print("Вы ввели неверное значение, введите значение от 1 до 12")
print(f'{month} месяц это {year_dict.get(month)} ')
print(f'{month} месяц это {year_list[month-1]} ')
